ZAP9-AI/Intelligent-LED-lamp-based-on-STM32/HARDWARE/ADC/adc.c
#include "delay.h"
#include "sys.h"
#include "stm32f10x_adc.h"
#include "adc.h"

//=========================================================================================
/**********************************初始化ADC**********************************************/
/**********************************ADC通道初始化**********************************************/
//=========================================================================================
		   
void Adc_Init(void)                                                              
{
	ADC_InitTypeDef ADC_InitStructure; 
	GPIO_InitTypeDef GPIO_InitStructure                          ;//定义GPIO结构体
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA |RCC_APB2Periph_ADC1	, ENABLE )    ;//使能GPIOA,ADC1通道时钟
  
	RCC_ADCCLKConfig(RCC_PCLK2_Div6)                                                ;//分频因子6时钟为72M/6=12MHz
	
	GPIO_InitStructure.GPIO_Pin  = GPIO_Pin_1|GPIO_Pin_2         ;//PA1 PA2 anolog输入
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN                 ;//模拟输入引脚
	GPIO_Init(GPIOA, &GPIO_InitStructure)                        ;//初始化GPIO	

 	ADC_DeInit(ADC1)                                                                ;//将外设 ADC1 的全部寄存器重设为缺省值
 
	ADC_InitStructure.ADC_Mode = ADC_Mode_Independent                               ;//ADC工作模式:ADC1和ADC2工作在独立模式
	ADC_InitStructure.ADC_ScanConvMode = DISABLE                                    ;//模数转换工作在单通道模式
	ADC_InitStructure.ADC_ContinuousConvMode = DISABLE                              ;//模数转换工作在单次转换模式
	ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None              ;//转换由软件而不是外部触发启动
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right                           ;//ADC数据右对齐
	ADC_InitStructure.ADC_NbrOfChannel = 1                                          ;//顺序进行规则转换的ADC通道的数目
	ADC_Init(ADC1, &ADC_InitStructure)                                              ;//根据ADC_InitStruct中指定的参数初始化外设ADCx的寄存器	
 
	ADC_Cmd(ADC1, ENABLE)                                                           ;//使能指定的ADC1

	ADC_ResetCalibration(ADC1)                                                      ;//重置指定的ADC1的复位寄存器

    while(ADC_GetResetCalibrationStatus(ADC1))                                    ;//获取ADC1重置校准寄存器的状态,设置状态则等待

	ADC_StartCalibration(ADC1)                                                      ;//重置指定的ADC1的复位寄存器

	while(ADC_GetCalibrationStatus(ADC1))                                           ;//获取指定ADC1的校准程序,设置状态则等待
	
}

//================================================================================================
/**********************************ADC1_CHx 通道转换*********************************************/
//================================================================================================
u16 Get_Adc(u8 ch)   
{
	ADC_RegularChannelConfig(ADC1, ch, 1, ADC_SampleTime_239Cycles5 )               ;//ADC1,第一个转换,采样时间为239.5周期	  			    
 
	ADC_SoftwareStartConvCmd(ADC1, ENABLE)                                          ;//使能指定的ADC1的软件转换启动功能
	while(!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC ))                                  ;//等待转换结束
//	ADC_ClearFlag(ADC1, ADC_FLAG_EOC); 
	return ADC_GetConversionValue(ADC1)                                             ;//返回最近一次ADC1规则组的转换结果
}


//=========================================================================================
/***************************读取Light Sens_1 环境光敏传感器的值***************************/
/***************************0~1000:0,最暗;1000,最亮***************************************/	
//=========================================================================================



u16 Get_Natural_Light(void)
{
	u16 lsens1_val               = 0                             ;//定义变量接收环境光的值
	u8 t                                                           ;//定义变量接收次数
	for(t=0;t<READ_TIMES;t++)
	{
		lsens1_val                += Get_Adc(ADC_Channel_1)        ;//读取ADC值
		delay_ms(5)                                                ;//延时5ms
	}
	lsens1_val                  /=READ_TIMES               ;//得到平均值 
	lsens1_val = (u16)(lsens1_val*(1000.0/4096.0));
	return (lsens1_val)                                 ;//返回获取的光照强度
}
//=========================================================================================
/***************************读取Light Sens_2 灯光光敏传感器的值***************************/
/***************************0~1000:0,最暗;1000,最亮***************************************/	
//=========================================================================================
																												
u16 Get_LED_Light(void)
{
	u16 lsens2_val               =0                              ;//定义变量接收LED光的值
	u8 t                                                         ;//定义变量接收次数
	for(t=0;t<READ_TIMES;t++)
	{
		lsens2_val                += Get_Adc(ADC_Channel_2)        ;//读取ADC值
		delay_ms(5)                                                ;//延时5ms
	}
	lsens2_val                  /=READ_TIMES               ;//得到平均值 
	lsens2_val = (u16)(lsens2_val*(1000.0/4096.0));
	return   (lsens2_val)                               ;//返回获取的光照强度Lux
}
